* Career Starting
** events
*** start programming
date: 2015.9 start with C
*** continue
date: 2016.2 code in C++ with my first computer
*** explore
date: 2016.4 learn java by watching videos
*** DONE practice
    DEADLINE: <2018-10-01 Mon> SCHEDULED: <2017-11-14 Tue>
date: 2016.9 to now work on class project with java
such as discrete mathematics and data structures
*** New world!
date: 2017.8 learn to use linux and python
*** wait for stronger
date: 2017.10 get used to editing with vim or emacs
*** focus on spacemacs
    SCHEDULED: <2018-11-20 Tue>
 install spacemacs and learn to master it   
** org-mode test
*** list
* Learn Emacs
** DONE learn emacs                                                  :ATTACH:
   DEADLINE: <2017-12-15 Fri> SCHEDULED: <2017-11-14 Tue>
   :PROPERTIES:
   :Attachments: career.org
   :ID:       80e354bb-47c0-4d5a-9f63-80bf36e1bd19
   :END:
** TODO [#B] learn elisp                                             :study:
:PROPERTIES:
:LAST_REPEAT: [2017-12-24 Sun 20:58]
:END:
- State "DONE"       from "TODO"       [2017-12-24 Sun 20:58]
[[info:eintr#narrow%20Exercise][info:eintr#narrow Exercise]]
   SCHEDULED: <2017-12-26 Tue 20:45 .+2d>
   :PROPERTIES:
   :LAST_REPEAT: [2017-12-22 Fri 14:46]
   :END:
   - State "DONE"       from "TODO"       [2017-12-22 Fri 14:46]
   - Note taken on [2017-12-22 Fri 14:46] \\
     ready for 6.3 exercise narrowing
   - Note taken on [2017-12-20 Wed 12:47] \\
     ready for chapter 6
   - State "DONE"       from "TODO"       [2017-12-20 Wed 12:07]
   - State "DONE"       from "TODO"       [2017-12-18 Mon 23:21]
   - Note taken on [2017-12-18 Mon 11:42] \\
     ready 5.2.6
   - State "DONE"       from "TODO"       [2017-12-16 Sat 14:02]
   - State "DONE"       from "TODO"       [2017-12-13 Wed 10:56]
   - Note taken on [2017-12-09 Sat 15:08] \\
     ready for chapter five
   - State "DONE"       from "TODO"       [2017-12-09 Sat 15:08]
   - State "DONE"       from "TODO"       [2017-12-07 Thu 21:56]
   - Note taken on [2017-12-07 Thu 21:54] \\
     finished to ready for 3.10.1 template for a save-excusion expression
   - Note taken on [2017-12-07 Thu 14:30] \\
     finished 3.6.2 sample let expression
   - State "DONE"       from "TODO"       [2017-12-05 Tue 22:39]
   - Note taken on [2017-12-05 Tue 22:38] \\
     finish chapter 3.3 and get ready for chapter 3.4 different options for interactive
   - State "DONE"       from "TODO"       [2017-12-03 Sun 14:15]
   - State "DONE"       from "TODO"       [2017-12-01 Fri 14:57]
   https://www.gnu.org/software/emacs/manual/html_mono/eintr.html
   :PROPERTIES:
   :LAST_REPEAT: [2017-11-29 Wed 20:43]
   :END:
   - State "DONE"       from "TODO"       [2017-11-29 Wed 20:43]
   :LOGBOOK:
   CLOCK: [2017-12-24 Sun 14:02]--[2017-12-24 Sun 15:12] =>  1:10
   CLOCK: [2017-12-22 Fri 14:14]--[2017-12-22 Fri 14:46] =>  0:32
   CLOCK: [2017-12-20 Wed 09:52]--[2017-12-20 Wed 10:32] =>  0:40
   CLOCK: [2017-12-18 Mon 11:08]--[2017-12-18 Mon 11:42] =>  0:34
   CLOCK: [2017-12-15 Fri 21:01]--[2017-12-15 Fri 21:53] =>  0:52
   CLOCK: [2017-12-14 Thu 14:47]--[2017-12-14 Thu 14:53] =>  0:06
   CLOCK: [2017-12-13 Wed 09:46]--[2017-12-13 Wed 10:56] =>  1:10
   CLOCK: [2017-12-09 Sat 13:44]--[2017-12-09 Sat 15:08] =>  1:24
   CLOCK: [2017-12-07 Thu 20:59]--[2017-12-07 Thu 21:55] =>  0:56
   CLOCK: [2017-12-07 Thu 12:25]--[2017-12-07 Thu 13:01] =>  0:36
   CLOCK: [2017-12-05 Tue 22:26]--[2017-12-05 Tue 22:39] =>  0:13
   CLOCK: [2017-12-05 Tue 22:03]--[2017-12-05 Tue 22:26] =>  0:23
   CLOCK: [2017-12-05 Tue 20:46]--[2017-12-05 Tue 21:11] =>  0:25
   CLOCK: [2017-12-01 Fri 14:23]--[2017-12-01 Fri 14:48] =>  0:25
   CLOCK: [2017-12-01 Fri 13:53]--[2017-12-01 Fri 14:18] =>  0:25
   CLOCK: [2017-12-01 Fri 13:23]--[2017-12-01 Fri 13:48] =>  0:25
   CLOCK: [2017-11-27 Mon 22:07]--[2017-11-27 Mon 22:07] =>  0:00
   :END:
** DONE hacking emacs
   CLOSED: [2017-11-26 Sun 13:08] DEADLINE: <2017-12-15 Fri> SCHEDULED: <2017-11-15 Wed>
** DONE learn spacemacs
   CLOSED: [2017-11-27 Mon 21:56] SCHEDULED: <2017-11-22 Wed>
** DONE hacking spacemacs
   CLOSED: [2017-11-27 Mon 21:56] SCHEDULED: <2017-11-22 Wed>
* Accounts 
** pycharm account
password + G
